Revit 2024 API
AnalyticalToPhysicalAssociationManager.AddAssociation Method
Overload List
Name | Description
AddAssociation(ElementId, ElementId)
 Adds a new association between an analytical element and a physical element.
AddAssociation(ISet<ElementId>, ISet<ElementId>)
 Adds a new association between a group of analytical elements and a group of physical elements.
See Also
AnalyticalToPhysicalAssociationManager Class
AnalyticalToPhysicalAssociationManager Members
Autodesk.Revit.DB.Structure Namespace